app/views/events/index.html.erb

SELECT "events".* FROM "events"
---
<div class="col-md-12 all-events">
    <% Event.all.each do |event| %>