app/controllers/events_controller.rb

INSERT INTO "events" ("name", "date", "time", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    @current = User.find_by id: session[:user_id]
    @event.user_id = @current.id

    respond_to do |format|
      if @event.save

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 980190962]]
---
  def destroy
    #destroys relationships
    Party.deletion(@event.id).each do |temp|
      temp.destroy
    end
    @event.destroy