app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def new
    #prevents user from accessing signup when already logged in
    begin
      @user = User.find(session[:user_id])